package dataType;

public class Ex01 {
	public static void main(String[] args) {
		
//		변수를 선언할 때에는, 자료형과 변수이름을 적어주면 된다
		boolean bo;		// 참과 거짓을 나타내는 자료형으로 bo라는 변수를 선언한다 (값은 담지 않았다)
		bo = false;		// 이미 만들어진 변수에는 자료형을 적지 않는다
						// = 은 대입 연산자라고 하며, [오른쪽의 값을 왼쪽의 공간에 복사하여 저장한다]
		
		int n1 = 3;		// 변수를 선언하면서 동시에 대입하는 작업을 [변수의 초기화]라고 한다
		int n2;
		
		n2 = n1;		// n1이 가지는 [값]을 n2 [공간]에 복사하여 저장한다
		System.out.println("n1 : " + n1);
		System.out.println("n2 : " + n2);
		
//		이미 선언된 변수를 똑같은 이름으로 다시 선언할 수 없다
//		int n1 = 5;	// Duplicate local variable n1
//		변수는 어떤 변수인지 의미를 잘 전달할 수 있도록 이름을 지어야 하며, 중복되는 이름을 사용하면 안된다
		
		String academyName = "KG ITBANK";			// Camel Case
		String my_phone_number = "010-9128-3434";	// Snake Case
		
//		프로그래밍 언어에서는 어떤 데이터를 저장해 두었다가, 
//		원할 때에 다시 가져와서 사용하기 위해 변수 라는 형식을 사용한다
//		
//		변수는 값을 저장해 두고, 나중에 다시 불러오거나, 값을 변경할 수도 있다
//		
//		변수에 저장하는 데이터의 유형에 따라서, 사용되는 메모리의 크기가 달라지거나, 자료가 바뀔수도 있다
//		
//		어떤 데이터를 저장할지 컴퓨터에게 알려줘야 하기 때문에, 변수는 자료형을 동반하여 설정해야 한다
		
//		자바에서는 총 8가지의 기본 자료형이 존재한다
		
//		bit : 192(10), 1100 0000(2), 1혹은 0이 들어가는 자리, 자리수가 8개이므로 8 bit
//		bit는 데이터의 단위로 사용하지는 않지만, 데이터를 구성하는 단위로 생각한다
		
//		1 Byte = 8 bit
//		1 Byte 가 데이터를 구성하는 가장 기초적인 단위가 된다
		
//		1000과 가장 가까운 2^10(1024)을 단위로 설정하여
//		1 KB = 1024 Byte
//		1 MB = 1024 KB
//		1 GB = 1024 MB
//		1 TB = 1024 GB
		
//		2^7		2^6		2^5		2^4		2^3		2^2		2^1		2^0
//		128		64		32		16		8		4		2		1
//		
		
//		0000 0000	: 0	
//		0000 0001	: 1	
//		0000 0010	: 2
//		0000 0011	: 3	(2 + 1, 2^1 + 2^0)
//		0000 0100	: 4	(4, 2^2)
//		0000 0101	: 5	(4 + 1, 2^2 + 2^0)
//		...
//		1111 1111	: 255
		
		
	}
}







